Repository: Masoudraja/navasanplus
Catalog: languages/mns-navasan-plus-*.po
Languages: fa_ir

source: Navasan Plus
fa_ir: نوسان پلاس

source: Access denied.
fa_ir: دسترسی مجاز نیست.

source: Navasan Plus Settings
fa_ir: تنظیمات نوسان پلاس

source: Navasan Plus Health Check
fa_ir: بررسی سلامت نوسان پلاس

source: Migrate from Navasan
fa_ir: مهاجرت از نوسان

source: Recalculate Prices
fa_ir: محاسبه مجدد قیمت‌ها

source: Assign Formula to Products
fa_ir: اختصاص فرمول به محصولات

source: Settings
fa_ir: تنظیمات

source: Health Check
fa_ir: بررسی سلامت

source: Migration
fa_ir: مهاجرت

source: Tools: Recalculate Prices
fa_ir: ابزارها: محاسبه مجدد قیمت‌ها

source: Tools: Assign Formula
fa_ir: ابزارها: اختصاص فرمول

source: Use the left submenu: Settings, Tools, Currencies, Formulas.
fa_ir: از منوی فرعی سمت چپ استفاده کنید: تنظیمات، ابزارها، ارزها، فرمول‌ها.

# Post Type General Name
source: Currencies
fa_ir: ارزها

# Post Type Singular Name
source: Currency
fa_ir: ارز

source: Currencies
fa_ir: ارزها

# Post Type General Name
source: Formulas
fa_ir: فرمول‌ها

# Post Type Singular Name
source: Formula
fa_ir: فرمول

source: Formulas
fa_ir: فرمول‌ها

source: Price Breakdown (preview)
fa_ir: تفکیک قیمت (پیش‌نمایش)

source: Final price (preview):
fa_ir: قیمت نهایی (پیش‌نمایش):

source: Connection successful.
fa_ir: اتصال با موفقیت برقرار شد.

source: Empty response received.
fa_ir: پاسخ خالی دریافت شد.

source: Service class not available.
fa_ir: کلاس سرویس در دسترس نیست.

source: Synced. Updated: %1$d, Created: %2$d, Skipped: %3$d
fa_ir: هم‌رسانی شد. به‌روزرسانی: %1$d، ایجاد شده: %2$d، رد شده: %3$d

source: Sync failed.
fa_ir: هم‌رسانی ناموفق.

source: API token regenerated.
fa_ir: توکن API مجدداً تولید شد.

source: Done.
fa_ir: انجام شد.

source: Failed.
fa_ir: ناموفق.

source: Formula
fa_ir: فرمول

source: — Select —
fa_ir: — انتخاب کنید —

source: Product IDs
fa_ir: شناسه‌های محصول

source: Optional. Comma-separated. Ranges allowed (10-15).
fa_ir: اختیاری. با کاما جدا شده. محدوده مجاز (۱۰-۱۵).

source: Categories
fa_ir: دسته‌بندی‌ها

source: Tags
fa_ir: برچسب‌ها

source: Options
fa_ir: گزینه‌ها

source: Dry run (no changes)
fa_ir: اجرای آزمایشی (بدون تغییر)

source: Enable rate-based pricing
fa_ir: فعال‌سازی قیمت‌گذاری بر اساس نرخ

source: Set dependency to Advanced (Formula)
fa_ir: تنظیم وابستگی به پیشرفته (فرمول)

source: Overwrite existing assigned formula (if any)
fa_ir: بازنویسی فرمول اختصاص یافته موجود (در صورت وجود)

source: Copy formula variables defaults into product overrides
fa_ir: کپی مقادیر پیش‌فرض متغیرهای فرمول در بازنویسی محصول

source: Clear simple pricing fields
fa_ir: پاک کردن فیلدهای قیمت‌گذاری ساده

source: Assign Now
fa_ir: اختصاص الان

source: Please select a valid formula.
fa_ir: لطفاً یک فرمول معتبر انتخاب کنید.

source: No products matched.
fa_ir: هیچ محصولی مطابقت نداشت.

source: Dry run: matched=%1$d, would_update=%2$d, skipped_existing=%3$d
fa_ir: اجرای آزمایشی: تطبیق=%1$d، به‌روزرسانی=%2$d، رد شده موجود=%3$d

source: Assigned to %1$d products. Skipped existing: %2$d
fa_ir: اختصاص داده شده به %1$d محصول. رد شده موجود: %2$d

source: Discount on Profit (%)
fa_ir: تخفیف روی سود (درصد)

source: Discount on Profit (Fixed)
fa_ir: تخفیف روی سود (ثابت)

source: Discount on Charge (%)
fa_ir: تخفیف روی اجرت (درصد)

source: Discount on Charge (Fixed)
fa_ir: تخفیف روی اجرت (ثابت)

source: Navasan Plus - Category Discounts
fa_ir: نوسان پلاس - تخفیفات دسته‌بندی

source: These discounts will be applied to products in this category upon creation.
fa_ir: این تخفیفات هنگام ایجاد محصولات در این دسته‌بندی اعمال خواهد شد.

source: Navasan Plus - Bulk Edit Discounts
fa_ir: نوسان پلاس - ویرایش گروهی تخفیفات

source: IMPORTANT: When you update the category, these values will be applied to ALL products in this category, overwriting their current discounts and recalculating their final prices.
fa_ir: مهم: هنگام به‌روزرسانی دسته‌بندی، این مقادیر به همه محصولات این دسته‌بندی اعمال شده، تخفیفات فعلی آن‌ها را بازنویسی و قیمت نهایی را مجدداً محاسبه می‌کند.

source: Clear Discounts Action
fa_ir: عملیات پاک کردن تخفیفات

source: Are you sure you want to clear these discounts for the category AND all its products?
fa_ir: آیا مطمئن هستید که می‌خواهید این تخفیفات را برای دسته‌بندی و همه محصولات آن پاک کنید؟

source: Clear All Discounts for This Category
fa_ir: پاک کردن همه تخفیفات این دسته‌بندی

source: This will remove the saved discounts from this category and all products within it.
fa_ir: این کار تخفیفات ذخیره شده از این دسته‌بندی و همه محصولات درون آن را حذف خواهد کرد.

source: Run automated checks to verify the plugin is wired correctly.
fa_ir: اجرای بررسی‌های خودکار برای تأیید اتصال صحیح افزونه.

source: Run Checks
fa_ir: اجرای بررسی‌ها

source: Check
fa_ir: بررسی

source: Result
fa_ir: نتیجه

source: Details
fa_ir: جزئیات

source: Manual update
fa_ir: به‌روزرسانی دستی

source: Navasan Plus – Price Preview
fa_ir: نوسان پلاس – پیش‌نمایش قیمت

source: Calculating…
fa_ir: در حال محاسبه...

source: Updated.
fa_ir: به‌روزرسانی شد.

source: Applied.
fa_ir: اعمال شد.

source: Failed to calculate.
fa_ir: محاسبه ناموفق بود.

source: Failed to apply.
fa_ir: اعمال ناموفق بود.

source: Current calculated price
fa_ir: قیمت محاسبه شده فعلی

source: Profit
fa_ir: سود

source: Charge
fa_ir: اجرت

source: Recalculate now
fa_ir: محاسبه مجدد الان

source: Apply to product prices
fa_ir: اعمال به قیمت‌های محصول

source: 1. What is WP-CLI and Why Use It?
fa_ir: ۱. WP-CLI چیست و چرا از آن استفاده کنیم؟

source: You've been using the %1$s plugin for more than a week. If you like it, please give us a %2$s rating.
fa_ir: شما بیش از یک هفته از افزونه %1$s استفاده کرده‌اید. اگر آن را دوست دارید، لطفاً به ما امتیاز %2$s دهید.

source: Assign Currency
fa_ir: اختصاص ارز

source: -- Select Currency --
fa_ir: -- انتخاب ارز --

source: Choose the base currency for all converted products.
fa_ir: ارز پایه را برای همه محصولات تبدیل شده انتخاب کنید.

source: Convert Products
fa_ir: تبدیل محصولات

source: Price Breakdown
fa_ir: تفکیک قیمت

source: Applied Discounts
fa_ir: تخفیفات اعمال شده

source: Currency Chart
fa_ir: چارت ارز

source: Invalid request.
fa_ir: درخواست نامعتبر.

source: PASS
fa_ir: موفق

source: FAIL
fa_ir: ناموفق

source: Currency
fa_ir: ارز

source: Current Rate
fa_ir: نرخ فعلی

source: Change
fa_ir: تغییر

source: From
fa_ir: از

source: To
fa_ir: به

source: Convert
fa_ir: تبدیل

source: Currency #%s
fa_ir: ارز #%s

source: Calculate
fa_ir: محاسبه

source: Result:
fa_ir: نتیجه:

source: No currencies available to convert.
fa_ir: هیچ ارزی برای تبدیل در دسترس نیست.

source: Filter by Category
fa_ir: فیلتر بر اساس دسته‌بندی

source: -- All Categories --
fa_ir: -- همه دسته‌بندی‌ها --

source: Only products in this category will be converted.
fa_ir: فقط محصولات این دسته‌بندی تبدیل خواهند شد.

source: Converted %d product.
fa_ir: %d محصول تبدیل شد.

source: Method 2: Update via Command Line (Recommended for many products)
fa_ir: روش ۲: به‌روزرسانی از طریق خط فرمان (توصیه شده برای محصولات زیاد)

source: WP-CLI is a command-line interface for WordPress. It allows you to perform administrative tasks directly from the server's terminal. We use this method for updating prices because it is much faster than other methods and, most importantly, it does not encounter the execution time limit (timeout) that exists in web admin pages. This method is the only reliable way for sites with thousands of products.
fa_ir: WP-CLI یک رابط خط فرمان برای وردپرس است. این ابزار به شما اجازه می‌دهد کارهای مدیریتی را مستقیماً از ترمینال سرور انجام دهید. ما از این روش برای به‌روزرسانی قیمت‌ها استفاده می‌کنیم چون بسیار سریع‌تر از روش‌های دیگر است و مهم‌تر از همه، با محدودیت زمان اجرا (timeout) موجود در صفحات مدیریت وب مواجه نمی‌شود. این روش تنها راه قابل اعتماد برای سایت‌هایی با هزاران محصول است.

source: 2. Prerequisites
fa_ir: ۲. پیش‌نیازها

source: SSH access to the site server.
fa_ir: دسترسی SSH به سرور سایت.

source: WP-CLI installed on the server (usually all good WordPress hosts have it).
fa_ir: نصب WP-CLI روی سرور (معمولاً تمام میزبان‌های خوب وردپرس آن را دارند).

source: The "MNS Navasan Plus" plugin must be active.
fa_ir: افزونه «نوسان پلاس» باید فعال باشد.

source: 3. Execution Steps
fa_ir: ۳. مراحل اجرا

source: Connect to the server:
fa_ir: اتصال به سرور:

source: Using a terminal application (like Terminal on Mac or PuTTY on Windows), connect to your server via SSH.
fa_ir: با استفاده از یک برنامه ترمینال (مثل Terminal در مک یا PuTTY در ویندوز)، از طریق SSH به سرور خود متصل شوید.

source: Navigate to the WordPress root folder:
fa_ir: رفتن به پوشه اصلی وردپرس:

source: Go to the path where the main WordPress files (like wp-config.php) are located. This path is usually public_html or your domain name.
fa_ir: به مسیری بروید که فایل‌های اصلی وردپرس (مثل wp-config.php) در آن قرار دارند. این مسیر معمولاً public_html یا نام دامنه شما است.

source: # Example: cd public_html
fa_ir: # مثال: cd public_html

source: Run the command:
fa_ir: اجرای دستور:

source: Copy and run the following command completely in the terminal:
fa_ir: دستور زیر را کامل در ترمینال کپی و اجرا کنید:

source: New Plugin (Navasan Plus) Info
fa_ir: اطلاعات افزونه جدید (نوسان پلاس)

source: Enter the ID of the formula you created in the new plugin.
fa_ir: شناسه فرمولی که در افزونه جدید ایجاد کرده‌اید را وارد کنید.

source: %s ago
fa_ir: %s پیش

source: %1$s at %2$s
fa_ir: %1$s در %2$s

source: Date
fa_ir: تاریخ

source: Rate
fa_ir: نرخ

source: Summary
fa_ir: خلاصه

source: Components
fa_ir: اجزا

source: Name
fa_ir: نام

source: Expression
fa_ir: عبارت

source: Role
fa_ir: نقش

source: profit
fa_ir: سود

source: charge
fa_ir: اجرت

source: Section
fa_ir: بخش

source: Invoice Rate
fa_ir: نرخ فاکتور

source: No currencies found.
fa_ir: هیچ ارزی یافت نشد.

source: Add Currency Variable
fa_ir: افزودن متغیر ارز

source: — select —
fa_ir: — انتخاب —

source: Add
fa_ir: افزودن

source: Cancel
fa_ir: لغو

source: Use this endpoint to push rates into your site (POST JSON).
fa_ir: از این نقطه پایانی برای ارسال نرخ‌ها به سایت خود استفاده کنید (POST JSON).

source: Or send the token via HTTP header: X-API-TOKEN
fa_ir: یا توکن را از طریق هدر HTTP ارسال کنید: X-API-TOKEN

source: Regenerate Token
fa_ir: تولید مجدد توکن

source: Create missing currencies if not found
fa_ir: در صورت یافت نشدن، ارزهای گم شده را ایجاد کن

source: No components defined for this formula.
fa_ir: هیچ جزئی برای این فرمول تعریف نشده است.

source: Profit:
fa_ir: سود:

source: Charge:
fa_ir: اجرت:

source: Other:
fa_ir: سایر:

source: Final:
fa_ir: نهایی:

source: Final Total
fa_ir: مجموع نهایی

source: Error:
fa_ir: خطا:

source: Language Settings
fa_ir: تنظیمات زبان

source: Configure the plugin language (overrides WordPress default).
fa_ir: پیکربندی زبان افزونه (اولویت بر تنظیم پیش‌فرض وردپرس).

source: Plugin Language
fa_ir: زبان افزونه

source: Use WordPress Default
fa_ir: استفاده از پیش‌فرض وردپرس

source: English
fa_ir: انگلیسی

source: Persian (فارسی)
fa_ir: فارسی (Persian)

source: Force plugin to use a specific language regardless of WordPress settings. Save and reload the page to see changes.
fa_ir: اجبار افزونه برای استفاده از زبان خاص صرف‌نظر از تنظیمات وردپرس. ذخیره کنید و صفحه را مجدداً بارگذاری کنید تا تغییرات را ببینید.

source: Configure the default rate service and caching.
fa_ir: پیکربندی سرویس نرخ پیش‌فرض و کش‌سازی.

source: Enable periodic sync from the selected service.
fa_ir: فعال‌سازی هم‌رسانی دوره‌ای از سرویس انتخاب شده.

source: Enter your Taban Gohar API username & password.
fa_ir: نام کاربری و رمز عبور API تابان گهر خود را وارد کنید.

source: 1–1440 minutes.
fa_ir: ۱–۱۴۴۰ دقیقه.

source: Enable periodic sync via WP-Cron
fa_ir: فعال‌سازی هم‌رسانی دوره‌ای از طریق WP-Cron

source: Last Sync
fa_ir: آخرین هم‌رسانی

source: How often to sync (minutes).
fa_ir: دفعات هم‌رسانی (دقیقه).

source: Test Connection (Taban Gohar)
fa_ir: تست اتصال (تابان گهر)

source: Sync Rates Now
fa_ir: هم‌رسانی نرخ‌ها اکنون

source: You do not have permission.
fa_ir: شما اجازه دسترسی ندارید.

source: Migrator class not available.
fa_ir: کلاس مهاجر در دسترس نیست.

source: This tool migrates specific variable values (like weight and fee) from the old Navasan plugin to the new Navasan Plus structure.
fa_ir: این ابزار مقادیر متغیر خاص (مانند وزن و اجرت) را از افزونه قدیمی نوسان به ساختار جدید نوسان پلاس مهاجرت می‌دهد.

source: Migration finished. See the report below.
fa_ir: مهاجرت به پایان رسید. گزارش را در زیر مشاهده کنید.

source: Migration failed. See the report below.
fa_ir: مهاجرت ناموفق. گزارش را در زیر مشاهده کنید.

source: New Formula ID
fa_ir: شناسه فرمول جدید

source: New "Weight" Variable Code
fa_ir: کد متغیر جدید "وزن"

source: Enter the variable code for "weight" from your new formula.
fa_ir: کد متغیر "وزن" را از فرمول جدید خود وارد کنید.

source: New "Fee" Variable Code
fa_ir: کد متغیر جدید "اجرت"

source: Enter the variable code for "fee" from your new formula.
fa_ir: کد متغیر "اجرت" را از فرمول جدید خود وارد کنید.

source: Old Plugin (Navasan) Info
fa_ir: اطلاعات افزونه قدیمی (نوسان)

source: Old "Weight" Meta Key
fa_ir: کلید متا قدیمی "وزن"

source: The exact meta_key for the old weight value in the wp_postmeta table.
fa_ir: کلید دقیق meta_key برای مقدار وزن قدیمی در جدول wp_postmeta.

source: Old "Fee" Meta Key
fa_ir: کلید متا قدیمی "اجرت"

source: The exact meta_key for the old fee value in the wp_postmeta table.
fa_ir: کلید دقیق meta_key برای مقدار اجرت قدیمی در جدول wp_postmeta.

source: Run Migration
fa_ir: اجرای مهاجرت

source: Products Scanned
fa_ir: محصولات بررسی شده

source: Products to be Updated
fa_ir: محصولات برای به‌روزرسانی

source: Found "Weight" Values
fa_ir: مقادیر "وزن" یافت شده

source: Found "Fee" Values
fa_ir: مقادیر "اجرت" یافت شده

source: Item
fa_ir: آیتم

source: Count / Details
fa_ir: تعداد / جزئیات
